import React from 'react';
import './About.css'; // Імпортуємо стилі для компонента About
import aboutImage from './about.jpg'; // Імпортуємо зображення

function About() {
  return (
    <div className="about-container">
      <div className="about-image" style={{ backgroundImage: `url(${aboutImage})` }}></div>
      <h2 className="about-heading">Про нашу навчальну лабораторію</h2>
      <p>Наша навчальна лабораторія надає студентам унікальну можливість зануритися в практичне навчання та наукові дослідження. Ми оснащені сучасним обладнанням та технологіями, що дозволяють студентам отримати необхідні навички для успішної кар'єри.</p>
      <p>У нашій лабораторії студенти працюють над реальними проектами, беруть участь у дослідницьких програмах та навчаються застосовувати теоретичні знання на практиці. Ми сприяємо розвитку критичного мислення, творчості та інновацій, готуючи наших студентів до викликів сучасного світу.</p>
    </div>
  );
}

export default About;